cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'imagemagick'
brew 'spaceman-diff'
brew 'wget'

cask 'android-platform-tools'
cask 'android-studio'
cask 'diffusionbee'
cask 'handbrake'
cask 'qlvideo'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
# cask 'zed'


# Taps
# tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Binaries
# brew 'awscli'
# brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
# brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
# brew 'jq' # Used for spatie/visit
brew 'mackup'
# brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'imagemagick'
brew 'yarn'

# Apps
#cask 'figma'
cask 'firefox'
#cask 'github'
cask 'google-chrome'
#cask 'helo'
cask 'herd'
cask 'httpie'
cask 'imageoptim'
# cask 'pastebot'
cask 'jumpcut'
# cask 'screen-studio'
cask 'the-unarchiver'
cask 'visual-studio-code'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-roboto'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'

# Mac App Store
# mas 'Byword', id: 420212497
# mas 'Giphy Capture', id: 668208984
# mas 'Keynote', id: 409183694
# mas 'MyWoosh', id: 1498889644
# mas 'Numbers', id: 409203825
# mas 'Speedtest', id: 1153157709
# mas 'Spring', id: 1508706541
# mas 'Things', id: 904280696